[
  {
    "title": "The Perfect Setting: 7 Classic Dining Table Decoration Ideas",
    "date": "December 15, 2021",
    "author": "By Ikai Asai",
    "excerpt": "There’s something so magical in the way the monsoon greets you - cool breeze gently brushing your skin, the rustling and swaying of leaves, sweet scent of petrichor emanating from...",
    "url": "https://ikaiasai.com/blogs/blogs/table-decor-ideas",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/1620x1620-4_1080x.jpg",
    "content": "There’s something so magical in the way the monsoon greets you - cool breeze gently brushing your skin, the rustling and swaying of leaves, sweet scent of petrichor emanating from the earth, and the feeling of refreshment lingering in the air, long after the rains have bid us goodbye. Even the grey skies come with a silver lining, and leave us swimming in a sea of sweet nostalgia. The season of showers calls for celebrations with loved ones; and celebrations call for settings that sweep your guests off their feet. When it comes to impressive settings, the table sits at the centre of it all. If you are wondering how to decorate a table; here are some of the classic dining table decor ideas to bring obvious charm to your celebrations:\n\nTop 7 Dining Table Decorations For Home\n\nGo White, All The Way:\n\nNothing defines elegance better than white. If your occasion demands a sense of sobriety, then all-white is your best bet. Start with a plain white tablecloth or one with minimal patterns studded across; pair it with off white table mats. You can even experiment with light-colored table runners as well. Choose white ceramic cutlery (Plates & Carafes). Use a glass vase as a centrepiece blooming with white chrysanthemums or dahlias. This one will make for the ideal formal dinner setting.\n\nLet Candles Steal The Spotlight:\n\nWhen it comes to lighting, there’s plenty out there to choose from. But, nothing can quite create a subtly warm ambience like candles do. If your celebration is to begin at twilight, then candles placed at the centre of the table will serve as the perfect guides. Think of long candles standing tall, placed securely in their holders. Your dimly lit table will bring the much-needed warmth on a pleasantly cool monsoon evening.\n\nTake The Rustic Road:\n\nWhen it’s a family gathering, rustic goes a long way! If your table is coated in a brilliant wooden texture, you can skip the tablecloth for this one. Use linen napkins and table mats to keep the food from spilling. Serve food on light-colored plates to make them look all the more inviting. Place glass jars on the table to hold beverages. You can find comfort in the warmth of candles here as well. Create combinations of silverware, glasses, and ceramic serveware, but make sure that each piece complements the other.\n\nBring Nature To The Table:\n\nMonsoon is when nature blooms in all its glory. Make the little gems of nature a part of your celebration, and cheerful times will follow. Fill glass jars with low flowers so that people can see each other across the table. Fruit bowls are an absolute must. Another important element that best represents the gorgeous greens are succulents. Give them their well-deserved spot on your table and revel in the instant refreshment that they bring.\n\nMake Room For Royalty:\n\nDark blue, black & golden - the colors that best represent royalty! Set your table decor using tablecloths, table mats, napkins - all in these royal colors. The dark-colored tablecloth and mats will allow the silverware or brassware to shine brighter. Place red roses at the centre of the table in brass vases. Make sure your drinkware and serveware follow the same theme. A dimly lit ambience gives the ideal vintage look to your setting; floating candles in glass bowls will help you achieve just that.\n\nAssemble All-things-abstract:\n\nIf your guests are passionate about art and appreciate creativity, this one is your go-to theme. Indulge in abstract art to curate a contemporary setting. Table sculptures can make for the ideal centrepieces with this theme. Surround it with serveware and dinnerware that feature a unique form; polished with colors that have a mind of their own. Instead of placing the table runner along the length of the table, place it along its width.\n\nParty With A Pop Of Color:\n\nIf you are looking forward to a fun monsoon brunch with your friends, this theme is the one you must turn to! This is where you can let your imagination run wild and free. Take inspiration from the rainbows that adorn grey skies; paint your table colorful with dinnerware, serveware and table linen. Make sure that the contrasts don’t overpower the theme. If each element on the table works in tandem with the other, your ideas will impress. Fill bowls and vases with colorful candies and all kinds of flowers put together in a bunch. For a final touch, dabble into a little sparkle.\n\nBring Home Handcrafted Table Decoration Items From Ikai Asai\n\nPick the theme according to your occasion, and bring your vision to life with Ikai Asai. We are home to handcrafted pieces that perfectly fit into these beautiful yet simple table setting ideas. Each piece is artistic, and helps you curate inspiring tablescapes - browse through our handcrafted collections of Table Linen , Serveware , Dinnerware , Drinkware , Barware & Décor ."
  },
  {
    "title": "An Elegant Touch To Your Setting: All-things Table Runners",
    "date": "December 15, 2021",
    "author": "By Ikai Asai",
    "excerpt": "Of all the arts that adorn our lives with sheer delight, the art of hosting is one that has evolved gracefully; one that involves more of giving. As a host,...",
    "url": "https://ikaiasai.com/blogs/blogs/table-runner",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/1620x1620-7_1080x.jpg",
    "content": "Of all the arts that adorn our lives with sheer delight, the art of hosting is one that has evolved gracefully; one that involves more of giving. As a host, when you invite someone over, you allow them to enter into your world, and give them a glimpse into what your idea of a delightful evening looks like. They take out the time, not just for a few sips and bites, but for an experience that holds memories worth a lifetime. An excellent way to be the perfect host is to explore the enticing themes; and there’s plenty out there to experiment with - rustic, bohemian, classic, minimal, contemporary, abstract, floral, all-things-DIY and the list goes on. No matter the theme, the important thing is that it has to reflect in every detail, right from the room décor to the dinnerware / serveware to the table setting. One of the newest and the nicest additions that has taken a well-deserved spot on the table is a table runner . Pairing dining table mats with runners is now a popular phenomenon. Table runners and placemats perfectly complement each other if chosen wisely. Make sure that either the color shade or the pattern matches in one way or another. So, what is a table runner? Table runners are narrow lengths of cloth that are usually placed at the centre of the table along its length. Today, they don't just serve the purpose of keeping you from spilling food over the table. They are also used as a decorative piece that goes well with the rest of the theme. Table Runners come to the rescue every single time you need to add a certain charm to your setting - be it a buffet setting or a sit-down formal dinner setting. Dining table runners are important elements that make the bigger picture look much better, as long as they fit right into the theme. Different occasions call for different table runners - it all significantly depends on the theme you want to follow. Here are some dining table runner ideas-\n\nTop 3 Table Runner Ideas\n\nPick the table runner that is the same length as your table cloth, a little longer than the length of your table. Predominantly, table runners are placed lengthwise and at the centre of the table. They are also placed in a way that both ends (about 7-12 inches) of the table runner are left hanging over the edges, as far down as a tablecloth. It should also cover at least one third of the table’s surface.  You can stick to a simple style by choosing a light-colored table runner in accordance with the theme. The centerpieces can then be arranged on top along the centre. You can then move on to place the table mats , napkins , and dinnerware to complete the table setting.\n\nIf you are a little bit of a risk-taker and love taking the out-of-the-box road, this idea is a must-try. Placing table runners width-wise with the ends dangling down the edges makes for an informal table setting. However, you have to make sure to use a table runner that is shorter in length so it does not look out of place, but rather in sync with the theme. If you use multiple table runners across the table, you can skip the placemats and leverage the power of larger chargers instead. If your table is long in length, then these short table runners placed width-wise can look visually stunning.\n\nIf you have an impressive table and do not want to hide its intricate details under covers, pick shorter table runners. Essentially, table runners should be longer in length, slightly longer than the length of your table. But shorter table runners are the suitable choice for causal settings. They can perfectly serve the purpose of a table runner and add a tinge of grace, while also allowing your table to take the centre stage.\n\nTable Runners By Ikai Asai\n\nLinen pieces by Ikai Asai are born out of that Tangaliya weaving craft by skilled artists in Gujarat. It is an extra weft weaving technique much like embroidery where the pattern is inlaid in the weft and warp by hand. The bead - like inlay bejewel the final fabric. It was made in intricate patterns with wool for the skirts of women from pastoral communities. For our Deva, the design and techniques of both Suf and Tangaliya have been given a fresh treatment to take it into the lives of a more global community. If you have been looking for elegant Table runners in India, Ikai Asai is where you will find them.\n\nIn the initial days, only the Dangasia community had inherited the knowledge and skills required for the Tangaliya weave . Later various communities from Gujarat and Rajasthan such as Gurjara, Maheshwari’s and Marwadas picked up this craft, each adding their own twist to it. Inspired by intricate patterns on woollen skirts of women from pastoral communities in Kutch, our weavers give the fabric a contemporary look that appeals to our global community. The essence of Tangaliya weaving is the compositions created by colourful dots, which are simultaneously stitched on both sides of the fabric. Tangaliya weave is an extra weft weaving technique, very similar to embroidery, but more painstaking where the pattern is inlaid in the weft and warp by hand. This intricate process of twisting the weft while weaving creates beautiful geometric patterns and forms, resulting in a bead-like inlay that bejewels the final fabric.\n\nDO:\n\n-Wash each piece of fabric separately.\n\n-Make sure to use a laundry bag while washing.\n\n-Make sure to iron the fabric inside out.\n\nDON'T:\n\n-Tumble dry the fabric in the washing machine.\n\n-Use any form of bleach or a harsh fabric cleaner. When it comes to eye-pleasing table settings or dining décor, a table runner goes a long way! If you love indulging in the art of hosting, our table runners are designed to fit into your dining themes. Explore our collection and place your order online."
  },
  {
    "title": "For Lasting First Impressions: Living Room Décor Ideas",
    "date": "December 15, 2021",
    "author": "By Ikai Asai",
    "excerpt": "A house is something made of four walls, a roof and a ceiling. A home, on the other hand, is a lot more than that. It is a safe place...",
    "url": "https://ikaiasai.com/blogs/blogs/living-room-decoration-ideas",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/1620x1620-8_1080x.jpg",
    "content": "A house is something made of four walls, a roof and a ceiling. A home, on the other hand, is a lot more than that. It is a safe place for us and our loved ones to make merry memories; it is our sanctuary, our comfort zone, our safe corner in the city. This home represents us in more ways that we think - how we polish every corner with care, how we adorn it with handpicked elements; each piece of décor gives the guests a glimpse into our very personality and a thoughtfully led lifestyle. When it comes to decorating homes in a way that they reel your guests right in, there is a treasure trove of ideas out there on how to decorate living rooms . Here are some home décor ideas for the living room that can help you get started-\n\nLiving Room Center Table Decoration Ideas\n\n1. Go Green:\n\nWhat better than a spacious living room with a little life thriving right in the centre of it? In a world that is now more inclined towards a sustainable way of life, you can extend your support by going green with your living room. Select a sturdy vase that can hold a little plant within; one that can best promote its growth. This makes for one of the most thoughtful living room corner table ideas for multiple reasons. You welcome a little bit of nature in the form of succulents or easy to maintain plants into your home, and they selflessly bring a fresh aura and obvious charm along with them. There are a number of Ceramic, Longpi or Stoneware succulent planters available out there, so you can experiment with the themes to your heart’s content.\n\n2. Floral Touch:\n\nAnother enticing and eco-friendly way of decorating your living room centre table is by adorning it with colorful flora and fauna. The best part is that you do not have to pluck the flowers off the plants. You can take some other creative routes instead. All you have to do is take a walk in the garden to take some inspiration. Then, you can create some DIY flowers out of colorful paper crafts and place them in a decorative way into glass vases. If you love indulging in the art of hosting in the evening, then you can place some scented candles alongside the glass canvases - this makes for an elegant setting for both formal and informal occasions.\n\nCorner Decoration Ideas For Living Rooms\n\n1. Art Corner:\n\nMaking a little room for art in your living room will always make for a pleasant experience for you and for your guests. If you yourself are an artist, then you can dedicate a corner of your living room to displaying your talent in all its glory. If you are a connoisseur of a certain kind of craft and love collecting different artifacts, you can put them on display in the living room corner for the world to enjoy the pieces just as much as you do. There are multiple brands out there who bring you easy access to lovely handmade pieces by artisans across the world - all online.\n\n2. Rustic Appeal:\n\nIf you love all-things-out-of-the-box and all-things-nature, here is an idea that is sure to take your fancy. Look for a large and sturdy chunk of a tree trunk. Level it out at the bottom in a way that it can hold its ground. You can then carve out different spots on the truck to place different items like photo frames or little souvenirs and gifts. You can even adorn it with little succulents. This will make for an idea that is exceptional both in terms of visual appeal and high functionality. Moreover, if your living room must follow a rustic theme, then this idea will fit perfectly into it.\n\nDiwali Decoration Ideas For Living Rooms\n\n1. Fairy Lights For The Win:\n\nDiwali being the festival of lights, it is only fair to brighten up your living room with some fancy fairy lights, while the diyas shine bright outside in your balcony or garden. When it comes to fairy lights, there is plenty to choose from as well, from stars to long strings studded with differently colored lights. You can let your creative juices flow freely and paint the corners of your living room in a way that brings out the best of your living room décor and wall colors / wallpapers. You can even roll a fairy light string and place it in a round glass vase at the centre of your table, surrounded by little scented candles.\n\n2. Little Lanterns All The Way:\n\nYes, as tradition demands, there has to be one large primary lantern that guards your door with pride during Diwali. However, that does not have to take away from the obvious charm of the little lanterns that accompany it. You can hang little lanterns that are in sync with your living room décor - in terms of colors, textures and such. Here is where you can indulge in some DIY fun to make merry festive memories with friends and family. These small lanterns will surely contribute greatly to giving a festive makeover to your living room.\n\nHandcrafted Vases By Ikai Asai\n\nNo matter the theme, the spot or the occasion, vases can play a vital role in making your living room more inviting. To help you adorn your living room with pieces that hold the power to impress and inspire, here are some handcrafted vases by Ikai Asai . Artisans from across the country delve into centuries-old craft types to bring you each piece, crafted to perfection-\n\n1. Longpi (Delhi):\n\nDistinguished by its surreal black glow and rustic matte finish, our Manipuri pottery carries great historical significance. Crafted by hand-patting clay, our unglazed pieces acquire their natural sheen from an age-old low-firing process. Moreover, Longpi chips on ageing, creating unique patterns on each artefact - the perfect homage to the beautiful imperfections of the handmade.\n\n2. Terracotta (Maharashtra):\n\nOur fine terracotta is handcrafted by gifted craftsmen, descending from a lineage of traditional kalakars. Using ancestral knowledge, our craftsmen channel the creative energy of the elements of nature, to create pieces that cut through the fabric of time and civilization.\n\n3. Glasswork (Delhi):\n\nIn the bustling town of Firozabad in India, our craftsmen follow centuries-old glass blowing traditions to create this glassware. Each piece is inflated with a blowpipe to form a glass bubble and then carefully moulded into contemporary glassware - the perfect amalgam of heritage and modern art.\n\n4. Kutch Clay (Gujarat):\n\nOur artist from Auroville has taken from her fond memories of watching a wise matriarch carefully store handmade pickles in off-coloured mustard jars to create tableware. We mould the essence of the venerated Barni, into exquisite stoneware, with each piece manifesting a distinct mustard glaze.\n\n5. Studio Pottery (Mysore):\n\nOur ceramic vases, with their rounded curves and light blue colour, are a playful yet elegant addition to any corner. They are handmade by artisans in Morbi, Gujarat. Place a bunch of white lilies or pink carnations in the vase for an easy fix to livening up a forgotten corner at home.\n\n6. Metal Work (Rajasthan):\n\nOur artists operate in Moradabad, the largest copper making region of India, rightfully known as the Peetal Nagri (Brass City). They use advanced technologies like electroplating, lacquering and powder coating to create contemporary metalware adorned with time-tested designs. Be it be festive occasions or an everyday affair - if you wish to transform your living room into a space that best shelters incredible experiences, our handcrafted vases are here to serve you well. Explore our Décor collection and select from pieces born out of inspiring crafts."
  },
  {
    "title": "For Evenings Dipped In Delight: All About Wine Decanting",
    "date": "December 15, 2021",
    "author": "By Ikai Asai",
    "excerpt": "One of the finest indulgences in life comes with half-filled wine glasses brimming with bliss; the kind that can be granted to us by no other. When it comes to...",
    "url": "https://ikaiasai.com/blogs/blogs/decant-wine",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/1620x1620-5_1080x.jpg",
    "content": "One of the finest indulgences in life comes with half-filled wine glasses brimming with bliss; the kind that can be granted to us by no other. When it comes to wonderful wine experiences, there are a lot of elements involved - selecting the wine that best pleases your palate, picking the right glasses for the wine you have chosen, a warm setting that accommodates all your loved ones; and above all, the most important contributor to delightful indulgences - the fine art of wine decanting. A wine decanter is essentially a vessel, usually made of glass, to pour wine in a certain manner into individual wine glasses. They often have an easy-pour neck and come in all shapes and sizes. When to decant a wine? The answer is simple - each time you wish to have a flavorful experience that serves all your senses. The art involves slowly pouring your wine from its original bottle into the glass vessel. This can be a tricky task at times because you are required to pour the wine into the decanter without disturbing the sediment at the bottom.\n\nWhy Decant Wine?\n\nThe simplest way to enjoy a wine’s characteristics is to decant it. Wine decanting is a calculated process designed to enhance the flavors and aromas of the wine. This elixir, loved by many, needs to interact with the oxygen in the air for a few minutes so that the tannins vanish to some extent and the flavors and aromas of the wine become more evident. All you have to do is allow the wine to breathe a little before it takes your breath away with every soul-soothing sip.\n\nHow To Decant A Wine?\n\nIt takes a true wine connoisseur to be able to master the art. If you are passionate about all-thing-wine, the process will surely make for interesting experiences blessed with an easy learning curve. If you are a beginner at decanting, it is best to first have to rely a little on guesswork. Decant it as per your instincts each time you open it, and keep track of what has worked well for that particular wine bottle so far. Overtime, it will come to you naturally.\n\nTo help you get started, here is how long you should decant wines:\n\n-Upto 30 minutes if the wine is young\n\n-1-2 hours if the wine is 5+ years old\n\n-3 hours if the wine is 10+ years old\n\nHow To Pour Wine From A Decanter?\n\nThe correct way to pour wine from a decanter depends on the kind of decanter you are using. The process is usually very simple, it's much like pouring wine from the bottle itself. After you have let the wine sit in the decanter for a sufficient amount of time, you can then swirl it a little bit and then pour it gently into your wine glass. Here are some types of wine decanters that you can ideally use for certain wines:\n\n-For Full-bodied Red Wines: A decanter with a wide base\n\n-For Medium-bodied Red Wines: Medium-sized decanter\n\n-For Light-bodied Red Wines: Small to medium-sized chilled\n\n-For White and Rosé Wines: Small chilled decanter\n\nHandcrafted Wine Decanters By Ikai Asai\n\nIkai Asai is home to uniquely shaped, hand-crafted wine decanters that never fail to bring a notion of aestheticism to the table. Each one is a proof of fine glasswork and is designed to serve a range of wines in a way that you get to best experience their flavours and aromas. Originating in first-millennium BC, the archaeological evidence of this craft was first found in the form of glass beads at Maski, a Chalcolithic site in the southern Deccan. After that, more than thirty archaeological sites in different regions of India have produced glass objects in different colours and forms such as bangles, ear-reels, eye-beads, tiles or fragmented vessels. Today, in the bustling town of Firozabad in India, our craftsmen follow centuries-old glass blowing traditions to create this glassware. Where each piece is inflated with a blowpipe to form a glass bubble and then carefully moulded into contemporary glassware - the perfect amalgam of heritage and modern art.\n\nHere is a glimpse into our thoughtful process - first, the molten glass is inflated with a blowpipe to form a glass bubble, which gives it a bulbous shape. Each piece is mouth-blown individually by our craftsmen. Then, each piece of inflated glass is moulded into a shape according to its utility. All our shapes are largely inspired by traditional Indian utensils; which is why this glassware is also well-known as Indian Hand-blown Glass. For the finest of experiences, you have to care for the wine accessories just as much as you care for wine. The better the accessories, the richer the indulgence. To help you make the most of the decanters for long, where are a few dos and don’ts that you must follow: DO:\n\n-To remove visibly accumulated dust or fingerprints, you can hand-clean the glassware using store bought glass cleaning products. First, you will have to flood the glass surface with a spray-on cleaning solution or use a cloth saturated with the cleaning solution. Then, gently rub the glassware clean.\n\n-Once the cleaning is done, wipe the wet surface with a clean, lint-free towel or cloth.\n\n-Then, wipe the glassware completely dry with another, lint-free towel or cloth.\n\n-There is one thing you have to be mindful of - while wiping the glass dry, make sure to stop when it is almost dry, leaving a uniform film on the glass surface. This helps prevent streaking.\n\nDON'T:\n\n-Stack the glassware with other vessels.\n\n-Use a harsh stainless steel/metal scrubber to clean. A more fascinating fact is that the shapes of our glassware have been kept very simple, in a way that they can casually compliment other materials as well. This way, the decanters not just bring you exquisite wine experiences, but also make for eye-pleasing showpieces on your table. No matter the theme you have chosen for your occasion, they are sure to fit perfectly into it. The next time you plan to host an evening adorned with the wonders of wine, trust one of our decanters to do the magic. You can explore our handcrafted collection of wine decanters , along with a varied range of wine glasses online, and select the ones that align well with your idea of wine indulgences."
  },
  {
    "title": "The Tale Of Terracotta: Origin, Products & Care",
    "date": "December 15, 2021",
    "author": "By Ikai Asai",
    "excerpt": "There are a lot of little-big things that define the world, as we know it - human evolution, technological advancements, co-existing communities, and the list goes on spending on different...",
    "url": "https://ikaiasai.com/blogs/blogs/terracotta-pottery",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/1620x1620-2_1080x.jpg",
    "content": "There are a lot of little-big things that define the world, as we know it - human evolution, technological advancements, co-existing communities, and the list goes on spending on different contexts. But at core of almost everything, lies the art that laid the foundation to better living. Ancient crafts that once only served aesthetic purposes, are not living up to their true potential in the functional sense as well. One of the centuries-old arts that has now become a modern-day wonder is Terracotta pottery. The actual translation of “Terracotta” is “baked earth” in Italian. The art forms include sculptures, figures, vessels or any kind of pottery born out of the craft. In order to give the right form to these structures, the art of Terracotta clay making has to be mastered. How is Terracotta made? The clay is born out of fairly coarse, porous clay. Previously, the raw clay was exposed to the sun at its strongest. Then, it was baked in primitive ovens created in the ashes of open fires. Today, the most common method of making terracotta is to work with refined clay. The very first step is to give a fitting form to the raw clay by moulding it into the shape that has been visualized. After the mould is dry, it has to be placed in a kiln or on top of a combustible material in a pit. Then, the firing process begins with the firing temperatures that ideally should reach up to 1,000°C.\n\nWhen this raw form of clay is treated under fire, it features different colours. The iron content gives the clay a reddish color as it interacts with oxygen during the firing process. But today, thanks to modern tools and techniques, you can also find terracotta clay art in shades of orange, yellow ochre, grey, pink or brown. As for the origins of Terracotta art , it has been long practiced in different cultures, to name a few - Chinese Pottery (from 10,000 BCE), in Greek Pottery (from 7,000 BCE). You can find one of its finest proofs in Mesopotamian and Egyptian arts and sculptures as well. During the ancient days, terracotta was primarily used for building-brick, roof tiles, and sarcophagi. In India, traditional terracotta sculptures, mainly religious, are quite a common sight. Apart from the century-old existence of the figures made from terracotta, the clay was also accepted as a great material for architectural purposes during the 19th century. By the arrival of the 20th century, the artisans and architects came to realise the aesthetic and functional value of terracotta, leading to the introduction of the terracotta houseware that have found their home on many shelves today. What is terracotta made of? Terracotta is a more evolved form of raw clay, in a sense. It is made from firing porous types of clay. The next question that comes to mind is - what exactly is the difference between terracotta and clay? Clay is the raw material. Whereas, terracotta is clay that is already moulded into a final form and fired. Earthenware that boasts a brilliant brown-orange color that is commonly known as terracotta. What makes terracotta stand out from the crowd is the fact that it is incredibly flexible in nature. It is relatively easier to work with as compared to other materials; regardless, it produces pieces that are just as worthy. Terracotta pieces can be formed by both the techniques - addictive and subtractive. Both these methods allow the artist to adorn the piece at hand with intricate details that are hard to miss. In addition to their rustic appeal, terracotta vessels also bring a treasure trove of health benefits - both in terms of cooking and storing food in them. Being some of the finest forms of earthenware, terracotta clay vessels are known to counterbalance the food’s acid content. They are perfect for storing dairy products. They are also incredibly convenient in the sense that they are microwave-safe, keeping you only minutes away from warm, healthy meals. They also contribute to enhancing the flavour of food and retaining its nutritive value as well.\n\nTerracotta Vessels & Vases By Ikai Asai\n\nHome to products created from ancient crafts, Ikai Asai is where you will find fine pieces of terracotta vessels and vases . Each one of our pieces is thoughtfully handcrafted in the heart of Maharashtra by gifted craftsmen, descending from a lineage of traditional kalakars. This art form harks back to the traditional uses of terracotta vessels such as to store water, to keep it cool on a hot summer's day or drinking warm chai in a kulhad (cup) moulded in clay. Using ancestral knowledge, our craftsmen channel the creative energy of the elements of nature, to create pieces that cut through the fabric of time and civilization.\n\nOur Process\n\nThe clay is first refined to remove the dust particles and other impurities. Then it's mounted at the centre of the potter's wheel for our craftsman to shape it. Once the shape is ready, it is dried under the sun for 2-3 days. It is then fired in a kiln, an open furnace, powered by local fuel such as dry coconut leaves or small wooden pieces. Once ready, this extensively treated piece is given a beautiful transparent glaze to give it a refined finishing.\n\nHow To Care?\n\nDO:\n\nClean your vessels immediately after you use them.\n\nSoak a soft sponge in tepid water, apply mild detergent and gently rub your vessel clean.\n\nGive your vessels enough time to dry, this helps to retain their natural finish.\n\nBe careful while using, since all tableware is susceptible to abrasion from repeated handling.\n\nMake sure to put a cushion of tissue / cloth between each product while stacking.\n\nThese vessels are microwave safe, so you can heat conveniently yet eat traditionally.\n\nDON'T:\n\nStack the vessels in the sink to wash them all at once.\n\nUse a harsh stainless steel/metal scrubber to clean.\n\nPut your vessels in a dishwasher to rinse or clean.\n\nStore food in the vessel overnight or for a long time.\n\nIf you are looking to adorn your living room, dining room or kitchen with the elegance of Terracotta clay art, then you will find the finest of dinnerware , serveware and décor born out of this craft at Ikai Asai. They make for subtly elegant pieces that fit perfectly into a varied range of hosting themes, to name a few - floral, rustic, minimal, DIY, abstract and many more. You can browse through our terracotta collection that features handcrafted plates, tumblers, bottles, snack bowl, vases, serving bowl with lid, and more."
  },
  {
    "title": "Bring Home Barware Essentials For Festive Indulgences",
    "date": "October 17, 2021",
    "author": "By Ikai Asai",
    "excerpt": "What makes an indulgence rare? What makes it linger, long after you have savoured that last sip or that last bite? Of course, it is the ingredients, the company, the...",
    "url": "https://ikaiasai.com/blogs/blogs/barware-essentials",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Blog_4_1080x.jpg",
    "content": "What makes an indulgence rare? What makes it linger, long after you have savoured that last sip or that last bite? Of course, it is the ingredients, the company, the setting, the ambience; but it is also the little-big details like dinnerware or drinkware that give celebrations their innate charm. When it comes to wine and dine evenings, casual cocktail lunches, or the on-the-rocks kind of nights, drinkware essentials are an important part of the recipe for memorable experiences. Plus, if you love the art of hosting, then these are an absolute must. What do barware essentials bring to the table, apart from the convenience aspect? They allow you to present your guests with beverages that serve all of their senses - from the appealing appearances that test their temptation, to the sensational flavors that tantalise their taste buds, to the aromas that paint the air with enchantment - each serving hits all the right notes. Moreover, the right set of essential cocktail glasses or wine glasses hold the power to best represent your hosting expertise. But, equipping your shelf or your bar with the ideal accessories can be a challenging task, if you do not know where to look for them. To make this a little easier for you, Ikai Asai has curated an exquisite barware collection featuring handcrafted pieces that are visually exceptional, and equally functional. Let’s take a closer look at our offerings:\n\nExplore Barware Essentials By Ikai Asai\n\nAPRICUS - Borosilicate Red Wine Glass\n\nCraft Type: Glass Work\n\nMade in: Rajasthan\n\nDimensions (cm): Length: 10.3 | Height: 19.9 | Breadth: 10.3 | Dia: 10.3\n\nNo. of pieces in a set: 2 Wine Glasses\n\nAPRICO - Borosilicate White Wine Glass\n\nCraft Type: Glass Work\n\nMade in: Rajasthan\n\nDimensions (cm): Length: 8.5 | Height: 21.1 | Breadth: 8.5 | Dia:8\n\nNo. of pieces in a set: 2 Wine Glasses\n\nGALLIVANTE - Glass Gin Goblet\n\nCraft Type:  Glass Work\n\nMade in: Uttar Pradesh\n\nMaterial: Glass\n\nDimensions (cm): Length: 11.5 | Height: 22.8 | Breadth: 11.5 | Dia: 11\n\nNo. of pieces in a set: 6 Glasses\n\nAGNI - Brass Coasters\n\nCraft Type: Metal Work\n\nMade in: Uttar Pradesh\n\nDimensions (cm): Length: 10 | Height: 0.7 | Breadth: 10\n\nNo. of pieces in a set: 4 Coasters\n\nVINOTO - Brass Corkscrew\n\nCraft Type: Metal Work\n\nMade in: Rajasthan\n\nDimensions (cm): Length: 15 | Height: 9.5 | Breadth: 1\n\nNo. of pieces in a set: 1 Corkscrew\n\nHERA - Wine Decanter\n\nCraft Type: Glass Work\n\nMade in: Rajasthan\n\nDimensions (cm): Length: 17.5 | Height: 26.6 | Breadth: 17.5 | Dia:17.5\n\nNo. of pieces in a set: 1 Decanter\n\nAPRICA - Borosilicate Champagne Flute\n\nCraft Type: Glass Work\n\nMade in: Rajasthan\n\nDimensions (cm): Length: 7 | Height: 20.8 | Breadth: 7\n\nNo. of pieces in a set: 2 Wine Glasses\n\nLAMERAS - Wine Decanter\n\nCraft Type: Glass Work\n\nMade in: Uttar Pradesh\n\nDimensions (cm): Length: 12.8 | Height: 36.2 | Breadth: 12.8\n\nNo. of pieces in a set: 1 Decanter with Stopper\n\nEUPHORIC - Whisky Glass\n\nCraft Type: Glass Work\n\nMade in: Uttar Pradesh\n\nDimensions (cm): Length: 8.9 | Height: 10.2 | Breadth: 8.9\n\nNo. of pieces in a set: 2 Whisky Glasses\n\nAMETO - Amethyst Peg Measure\n\nCraft Type: Stone Carving\n\nMade in: Rajasthan\n\nDimensions (cm): Length: 4.5 | Height: 11.2 | Breadth: 5.5 | Dia: 5.5\n\nNo. of pieces in a set: 1 Peg Measure\n\nCYNOSURE - Amethyst Shot Glass\n\nCraft Type: Stone Carving\n\nMade in: Rajasthan\n\nDimensions (cm): Length: 6.1 | Height: 6.4 | Breadth: 6.1\n\nNo. of pieces in a set: 2 Shot Glasses\n\nEUPHOR - Glass Decanter\n\nCraft Type: Glass Work\n\nMade in: Uttar Pradesh\n\nDimensions (cm): Length: 8.8 | Height: 37.2 | Breadth: 8.8\n\nNo. of pieces in a set: 1 Decanter with Top\n\nJUNO - Amethyst Bottle Stopper\n\nCraft Type: Stone Carving\n\nMade in: Rajasthan\n\nDimensions (cm): Length: 3.8 | Height: 11 | Breadth: 3.8\n\nNo. of pieces in a set: 1 Stopper\n\nOur barware features barware accessories that are born out of three crafts, practiced and perfected by skilled artisans from the many corners of the country- Glass Work: The archaeological evidence of this craft was first found in the form of glass beads at Maski, a Chalcolithic site in the southern Deccan, during the first-millennium BC. Today, in the bustling town of Firozabad in India, our craftsmen follow centuries-old glass blowing traditions to create this glassware. Where each piece is inflated with a blowpipe to form a glass bubble and then carefully moulded into contemporary glassware. Metal Work: Considered to be the most sophisticated, Brass cutlery is still preferred among affluent Indian households. Our immigrating artists operate in Moradabad, the largest copper making region of India, rightfully known as the Peetal Nagri (Brass City). Where they use advanced technologies like electroplating, lacquering and powder coating to create contemporary metal ware adorned with time-tested designs. Stone Carving: Ancient Greeks believed amethyst gems could prevent intoxication which is why wine goblets were specially carved from it. In addition to this, Medieval European soldiers wore amethyst amulets as protection in the battlefield, due to a prevalent belief that this gem calms the nerves. Inspired by such riveting tales from the past, our artists from Jaipur create amaranthine barware that induces a feeling of sitting for a drink in a tavern in medieval Greece.\n\nBuy Barware For Home Online\n\nEach one of our barware pieces is designed to uplift the spirits of your guests, by inviting them to indulgences par excellence. After all, no matter the occasion, it is the experience that counts. If you are a host that has been in search of essential bar glasses, or unique home bar glasses, you are sure to find the finest of the lot at Ikai Asai, along with a range of other accessories. Our barware is carefully crafted by artisans across the country - a fitting celebration for the creative crafts that stand tall on the foundation of centuries-old legacies. Bring home a little bit of this legacy, and set out on a journey to build your very own with Ikai Asai. Browse through our collection, take your pick and place your order online; lingering experiences await you."
  },
  {
    "title": "Age-Old Kansa Metal Craft: Origin, Benefits, Products & Care",
    "date": "October 17, 2021",
    "author": "By Ikai Asai",
    "excerpt": "Since the very beginning of time, planet earth was studded with hidden gems; each piece of land blanketing and guarding many treasures; each stone, precious in one way or another;...",
    "url": "https://ikaiasai.com/blogs/blogs/kansa-metal",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Blog_3_1080x.jpg",
    "content": "Since the very beginning of time, planet earth was studded with hidden gems; each piece of land blanketing and guarding many treasures; each stone, precious in one way or another; each stream, a source of life. These elements are what helped us evolve. As our ancestors shaped elements into utilities, they in turn shaped the way man lived. The ancient generations were not just precise, but also creative with the process, paving the way for different types of crafts: bamboo handicrafts, houseware, paper crafts, mosaic, stoneware crafts, spinning, and the list goes on. Over time, our needs and wants changed, and many of the ancient crafts got lost in transition. But, owing to their undeniable appeal and multiple advantages, few stood the test of time, and evolved ever so gracefully with it. One such art that has come a long way is Kansa Kaam! Before we dive into the enticing intricacies of the craft, let’s take a look at the origin of Kansa metal -\n\nKansa Metal & Craft: The History\n\nKansa was one of the first metal alloys brought into being. It was first made in the Bronze Age approximately 5000 years ago by the Harappans, the inhabitants of the Indus Valley. The fascinating thing is that it is the very same civilization that brought us the generous gift of Ayurveda, India's ancient healing system. Kansa is considered to be the healing metal of Ayurveda, the Science of Health and Longevity practiced throughout the East. Deemed as one of the strongest materials at the time, Kansa craft enabled ancient generations to create superior metal tools, sacred statues, housewares, bells and gongs as well as weapons and armor. Needless to say, it played a significant role in revolutionizing the traditional world, and continues to work wonders in the modern age as well.\n\nKansa Metal : Where It Stands Today\n\nOriginating from the times of Mahabharata, this craft has great spiritual significance even today. Considered to be veritably shudh (pure), these rustic kansa utensils are used in important religious ceremonies, such as Havanas and weddings.\n\nToday, Kansa still wears the crown of a powerful metal - a fine product of 78% copper and 22% tin, both heated together up to 700 centigrade to form pure bronze. Being adaptable in nature, it can be brilliantly moulded into handcrafted products with different kinds of patterns and finishes (matt or glossy). Given its healing properties, Kansa metal work is popularly used to eat food and drink water in.\n\nTop 4 Kansa Metal Benefits\n\n1. Great To Eat In:\n\nIf you have ever wondered - which metal plate is good for eating food in? Kansa is the answer! It is believed that using bronze plates for eating our food and drinking water on a daily basis enhances our immunity apart from purifying the food, thereby promoting our digestive health. Kansa metal also boosts your immunity system and enhances intellect.\n\n2. Aids With Cooking:\n\nOne of the other important benefits of eating in brass utensils is that it enhances your food experiences. Kansa is a metal that best retains heat, thereby keeping the food warmer and its contents richer for a longer period of time.\n\n3. Helps Maintain A Fresh Aura:\n\nKansa metal utensils benefit your ambience as well. The potential efficacy of its components improves indoor air quality.\n\n4. Highly Durable & Recyclable:\n\nAs Kansa is wear and tear-resistant, scratch and wrinkle-resistant, it can be used daily. With proper care, you will find that they are as good as new even after a decade or so. Moreover, it holds value even after maximum damage, as almost 90% of all bell metal alloys can be recycled.\n\nHandcrafted Kansa Products By Ikai Asai\n\nOur healing Kansa metalware is made using a four is to one proportion of copper to tin, a combination prescribed by the ancient Indian medical scholar Charak in Charak Samhita, the bible of ancient Indian medicine and surgery. Moreover, our gifted Kansari Karigars use only handmade tools to create alluring patterns on what is known to be the hardest metal to work on.\n\nOur Products:\n\n- Snack Plate\n\n- Polished Dinner Plates\n\n- Condiment Bowl\n\n- Small Bowl\n\n- Large Bowl\n\n- Soup Bowl\n\n- Tumblers\n\n- Brass Ladles\n\n- Salad Serving Spoons\n\n- Serving Bowls\n\n- Napkin Rings\n\n- Vase\n\nOur Process:\n\nOur Kansari Karigars belong to the tropical area of Orissa in India where the naturally hot environment combined with the excessive heat liberated during the crafting process, makes it difficult for them to work post afternoon. Most of our artisans start working much before dawn. Moreover, the entire process from melting Pital to the final embossing is done under one roof, where each member of the tribe specialises in and performs a singular part of the process. Here is a closer look at the same:\n\nOur craftsmen form an alloy of Kasa (Bell Metal) and Pital (Brass) and turn it into a metal ball - all using handmade tools such as Sandasi (pincers), Ruha/Ugha (file), Lihini (scraper), Kunda (lathe), Bhanra (hand-operated drill), Kala Pankha (hand blower), and Shanwashi (tongs).\n\nThis ball of metal is then melted and set into a small thick coin.\n\nThen using a Hatudi, the coin is hammered and beaten into the desired shape. After that the shape is cast and turned into a Koi (crucible). This entire process is called heat and beat. It is a collaborative activity needing the perfect coordination of at least four Kansari Karigars.\n\nExclusive Care For Your Kansa Products:\n\nDO:\n\n- Clean your vessels immediately after you use them.\n\n- Soak a soft sponge in tepid water, apply mild detergent and gently rub your vessel clean.\n\n- You can also use natural home remedies to clean your metalware, such as gently rubbing it with a mixture of imli (tamarind), lemon and salt.\n\n- Apart from detergent, you can use store-available solutions that are specifically made for cleaning traditional metalware such as Pitambari, Dara or Brasso.\n\n- Make sure to wipe your metalware dry with a clean cloth, this helps to retain its natural gleam.\n\nDON'T:\n\n- Eat excessively pungent or sour food in your metalware.\n\n- Stack the metalware in the sink while washing.\n\n- Use a stainless steel / metal scrubber to clean.\n\n- Use a dishwasher to rinse or wash these products.\n\n- Use a microwave to heat food in these products.\n\n- Store food in the vessels overnight or for a long time.\n\nIndulge in the art of hosting, like never before - bring home aesthetic pieces as well as good health with Ikai Asai. Experience the many bronze utensils benefits with our products, handcrafted to serve you wellness in its purest form. You can browse through our curated collections, select the ones that best fit into your theme, and place your order online."
  },
  {
    "title": "Best Diwali Gift Ideas: For The Love Of Festivals",
    "date": "October 17, 2021",
    "author": "By Ikai Asai",
    "excerpt": "Ours is a country that is home to diverse cultures and grand families - the two things that bring us many opportunities to truly revel in festive celebrations. Of the...",
    "url": "https://ikaiasai.com/blogs/blogs/diwali-gift-ideas",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Blog_2_1080x.jpg",
    "content": "Ours is a country that is home to diverse cultures and grand families - the two things that bring us many opportunities to truly revel in festive celebrations. Of the many occasions, Diwali is the one that paints the dusk a little brighter, as the entire nation celebrates as one. The gorgeous lanterns, little diyas of hope, platters full of savory snacks, homes adorned with fairy lights, well wishes pouring in from the most distant of family members - what’s not to love about this festival of lights? Moreover, the season where hearts are brimming with happiness and hope also brings us the perfect occasion to express our love for the ones dear to us; to tell them that much like sparkling night skies during Diwali, they light up our world too. But, the task of choosing the perfect present can be a challenging one with so many options available out there. To help you bring joy to your close ones, here is a list of the best gifts for Diwali-\n\nPresenting, The 5 Best Diwali Gift Ideas\n\n1. Dry Fruits Hamper / Exotic Sweets Hamper:\n\nWhat better than a hamper full of different varieties of dry fruits to wish good health to your loved ones. If it is a sweet tooth you wish to please, then a hamper full of exotic sweets will be your best bet. Or better yet, curate a hamper that brings the best of both worlds to the ones that matter the most to you. Given that conversations over something sweet and savory is what makes celebrations memorable, these hampers make for the ideal Diwali gifts.\n\n2. Exclusive Dinnerware & Serveware Sets:\n\nDiwali is one of those festivals where people travel long distances to be with their families, or friends that are no less than family. These rare reunions deserve to be made memorable with lingering dining experiences. If it is a family member or friend who loves the art of hosting, then a premium dinnerware set or serveware set will serve to be the perfect gift; it also makes for one of the best Diwali gift ideas for family. Ikai Asai is home to handcrafted dinnerware and serveware , designed for the ones who aspire to be the perfect host.\n\n3. Handcrafted Table Linen:\n\nA festive occasion means hosting elaborate dinners; hosting an elaborate dinner means unique table setting themes; and a unique table setting theme means hunting for table linen that never fails to impress. If your close ones love to be a host, exquisite table linen will bring them joy, in its truest form. The best part is that there is so much to choose from - placemats, tablecloths, napkins, and table runners. You will find the finest of table linen pieces with Ikai Asai.\n\n4. Exotic Teas & Coffees + Accessories:\n\nIf the gift receivers are tea or coffee connoisseurs, this one is the best gifting idea. Organic teas and coffees bring a treasure trove of health benefits. The brews born out of these blends also make for refreshing experiences, as your loved ones sip on the best of flavors while the enticing aromas soothe their senses. To make their experiences merrier, you can create a hamper full of exotic teas and coffees, along with accessories like tea / coffee pots or cups, strainers, infusers, storage canisters, and such.\n\n5. Candle Holder with Scented Candles:\n\nWho doesn’t love the soothing sight of scented candles, standing tall on exquisite candle holders , bringing some obvious charm to your table setting! It is the perfect gift for the ones who love to revel in rare aromas that linger for long. Just a few of the scented candles adorning the corners of one’s home are enough to create an inviting ambience - a warm welcome when you are hosting dinners. Ikai Asai brings you an exquisite collection of marble and brass candle holders that are products of excellent metal work.\n\nOrder Exclusive Diwali Gifts Online From Ikai Asai\n\nA gift is not merely a fancy object wrapped in impressive papers, it is a thoughtful gesture; a way of showing someone just how special they are; a promise that travels beyond boundaries. Special occasions demand gifts that best embody this gesture, and at Ikai Asai, you will find just that - handcrafted dinnerware, serveware, barware, table linen, drinkware and decor. Each piece of ours is a celebration of crafts that have evolved gracefully over time. Skilled artisans from across the world take a little bit of earth and give it not just a shape and form, but a story that tells itself. With the festive season just around the corner, these pieces will make for the best Diwali gifts. Here is what we offer when it comes to gifting:\n\nGift Sets\n\nIben (Glasswork):\n\n1 water jug & 6 water glasses\n\nSamar (Studio Pottery):\n\n2 tapas plates & 1 bowl\n\nThe Pickling Kit (Stoneware, Wood Work, Metal Work):\n\n1 wooden mortar pestle, 1 brass spoon, 1 stoneware jar with lid & 1 stoneware plate\n\nNitya (Kansa):\n\n2 soup bowls\n\nAmai (Marblework):\n\n1 cake stand & 1 cake server\n\nVantana Rose / Vantana Jade (Studio Pottery):\n\n2 bowls & 2 quarter plates\n\nInaki (Studio Pottery):\n\n1 kettle & 4 mugs\n\nChea (Wood Work):\n\n2 salad bowls, 1 spoon & 1 fork\n\nOdessa (Glasswork):\n\n1 Decanter with Lid & 2 wine glasses\n\nGift Cards:\n\nWhen in doubt, E-Gift Cards are what you must turn to! With Ikai Asai, you can choose a denomination, fill in the required information and add to cart. After you check-out, your gift card will be automatically emailed to your recipient. Once they receive the card, they can choose the pieces that they fancy.\n\nCorporate Gifts:\n\nAt Ikai Asai, we know that the word family extends to the ones who motivate us to climb the ladder of success. To express your gratitude to them, we also offer a bespoke range of handcrafted products for corporate gifting . With personal care, expert advice and special benefits, this service is specially designed to meet your specifications. If you have been in search of the perfect gift for Diwali, you can explore our curated collections, and select the ones that are sure to bring delight to your friends and family."
  },
  {
    "title": "For Your Work Family: Unique Corporate Gifting Ideas",
    "date": "October 17, 2021",
    "author": "By Ikai Asai",
    "excerpt": "Birthdays, anniversaries, graduations, promotions, weddings, festivals - there are some occasions in life that call for grand celebrations, each time they come around. Between the ever-busy schedules, these occasions present...",
    "url": "https://ikaiasai.com/blogs/blogs/unique-corporate-gifting-ideas",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Blog_5_1080x.jpg",
    "content": "Birthdays, anniversaries, graduations, promotions, weddings, festivals - there are some occasions in life that call for grand celebrations, each time they come around. Between the ever-busy schedules, these occasions present themselves as rare opportunities to forget the worries of the world and surround ourselves with people who give purpose to our lives. In the corporate world, colleagues, clients, and mentors are our family away from our family. They are the key witnesses of our struggles, as well as our little-big achievements. They are our selfless motivators, our well-wishers, and sometimes, our greatest challengers. So, why not share our happiness with the ones that help us climb the ladder of success faster? Why not limit the formalities to the four cubicle walls, and leave them behind when the clock strikes 5? There is no denying that since the work from home model was adopted by most companies, the lines between our work and personal worlds have blurred. Given its unquestionable success, it is evident that this way of work life is here to stay. As such, it is only wise for us to embrace the change and to use it to our advantage by welcoming more celebrations; more moments of joy. So, the next time an occasion is right around the corner, make sure that your work family is a part of it. Needless to say, these tokens of acknowledgement and appreciation will also help you build life-long alliances, and enhance productivity at work. To help you bring some casual celebrations to the corporate world, here are some sure-to-charm corporate gift ideas for employees and clients; each one tailored to delight a specific set of people.\n\n5 Tailored Corporate Gifting Ideas\n\nFor Nature Nurturers:\n\nIf your teams or your clients have a soft spot for the environment, the best way to bring a wide smile to their face is to give them something that helps them indulge in the little joys of nature. It can be as simple as a tool kit to help them better groom their gardens. If they do not have a garden of their own, this is the perfect opportunity to help them bring home a little bit of nature. How? By giving them gorgeous green succulents. You can even consider giving them rare / floral plant seeds. A handcrafted set of stoneware accessories can also do wonders as it will give their desks an earthy touch.\n\nFor Perfect Hosts:\n\nThere are those who love to receive, and then there is a rare breed of people who love to give and give to their heart’s content! These are the ones who make for a good host. They want nothing more than to create memorable experiences for the invitees. If your close ones or acquaintances at work love hosting, then help them master the art. You can do so by giving them wonderful pieces of table linen , or handcrafted sets of serveware or dinnerware . With a treasure trove of aesthetic options available out there, this one is a business gift idea that is easy to pursue, but is equally thoughtful.\n\nFor Fashion Influencers:\n\nIn every group, be it your colleagues or your childhood buddies, there is always that one person who never fails to make a style statement. To fan their flair for fashion, and to help them make more heads turn, you can give them the in-trend fashion apparels or accessories to help them stay a la mode. If you do not know them well enough, take time to understand their sense of fashion and pick something that is more in line with their style, they are sure to appreciate it. Of all, this is one of the most fun company gift ideas!\n\nFor Fitness Fanatics:\n\nBlessed are the ones born with naturally fit bodies and sharp minds. Most of us have to stick to our daily regimes to maintain a good physique and a calm state of mind. While many of us struggle with it, only few possess the sheer will to get off the bed and into fitness mode, daily. These brave hearts deserve to be appreciated with a fitting gift, as and when the opportunity knocks presents itself. When it comes to fitness gifting options, there is a lot you can choose from - a fit band, yoga mat, gym bag, shaker, compact gym equipment, gym safety gear, insulated water bottle, and the list goes on.\n\nFor Travel Enthusiasts:\n\nHere is where you can get quite creative. Gift shopping for travel wanderers can be a tricky task, especially if they travel often. No matter what you think of, chances are they already have it. But, that is not to say that there is nothing out there that can delight them. One of these options will prove to be a safe bet - personalized passport covers or journals, durable camping accessories, premium travel bag, travel pouch, antique compass, portable & foldable camping chair / stool, cozy sleeping bag, entertaining games like frisbee, and so on. Bring them gifts that will become their travel companions on every journey.\n\nOrder Unique Corporate Gifts Online From Ikai Asai\n\nThere is no better way to express your gratitude than to send a little token of appreciation. A little gift can go a long way, when it is thoughtfully chosen. If you have been in search of the ‘best corporate gifts for employees’ or ‘unique corporate gifts for clients’, Ikai Asai is where you will find it! We offer a bespoke range of handcrafted products that serve as the ideal corporate gift items. With personal care, expert advice and special benefits, this service is specially designed to meet your specifications. Give a gift that celebrates art in its aesthetic form. Each of our products draws from warm, earthy and vibrant tones, intended for one who appreciates the inherent luxury within organic, elemental and textural forms. They are differentiated by collaborative design interventions that further the legacy of Indian craft, making artisanal living desirable. Select from our carefully curated collections of tea / coffee sets , tableware , serveware , drinkware , metalware , dinner sets , decor and more."
  },
  {
    "title": "Revel In Floral Bliss: 7 Table Flower Decoration Ideas",
    "date": "October 17, 2021",
    "author": "By Ikai Asai",
    "excerpt": "As much as we love and crave greenery; it is not all that nature has to offer. Yes, the first thing we think of when it comes to nature are...",
    "url": "https://ikaiasai.com/blogs/blogs/7-table-flower-decoration-ideas",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Blog_1_1080x.jpg",
    "content": "As much as we love and crave greenery; it is not all that nature has to offer. Yes, the first thing we think of when it comes to nature are the vast stretches painted green through and through. But, one of its most breath-taking offerings is a flower blooming in all its glory, demanding attention, and rightfully so. Today, a flower is not simply a gift of nature. It is a declaration of love, a sign of hope, a peace offering, a friendship renewed, a way of bringing a little bit of nature to the table, and the list goes on. Above all, it is an indication that tomorrow will come bearing new beginnings. When flowers bring us the promise of having all that we dream of, it is only fitting to make them a part of our celebrations. Floral decorations on tables serve almost all senses - vibrant colors that are easy on the eyes; enchanting fragrances lingering in the air; the soothing touch of silk-like petals - everything about it makes for pleasant experiences. A floral touch can take you a step closer to becoming the perfect host. Here are some flourishing ideas for table decoration with flowers to help you host a memorable affair-\n\n7 Popular Flower Decoration Ideas\n\nThe world of flower decorations is vast, to say the least. The variations are available in abundance - an impressive range of colors, shapes, sizes, fragrances. This is what makes flower decoration for home a tricky task, but also a creative one. Let’s explore some simple, yet sensational ideas to turn your table into a masterpiece-\n\n1. The Best Of Everything:\n\nNature is generous in the sense that it has a lot to offer. Every little offering can add a lot of character to your setting. You can create an artistic centrepiece by pairing flowers with sticks or leaves in a tall vase . Assemble them in a way that the end result is a gorgeous mix of greens and flowers. The sticks can add a slightly rustic touch to a refreshing setting. Make sure to choose tall-stemmed flowers for this concept.\n\n2. DIY Flowers + Glass Bottles:\n\nNot all flowers have to be sourced straight from nature, some can be handcrafted out of paper as well. Pick some clear glass bottles and secure the paper flowers on to them in set patterns with some glue. You can weave the paper flowers into a string and create swirls around the glass bottles as well. Adding a string of fairly light along these swirls is the best way to light up your setting, and to best display your floral decorations.\n\n3. Lanterns Laced With Flowers:\n\nIf an inviting outdoor setting is what you desire, lanterns have to be a part of the picture. They do not have to be too extravagant. In fact, simple lanterns with a solid black or white frame are recommended so that there is more room for flowers to be the hero. Small flowers can be arranged in a colorful bunch and placed at the top of lanterns or around them. This will work wonders for a vintage-themed wedding reception.\n\n4. Flowers, Shimmering With Sparkles:\n\nNo matter the kind of celebration - birthdays, wedding receptions, baby showers, or close-knit get-togethers - adding some sparkle never hurts; especially when complemented with flowers. Select some tall silver or gold painted vases . Sprinkle a little bit of sparkle on your flower bunch, and place them in the glossy vases. The idea might seem a little too simple for a centrepiece but if done right, it can redefine elegance.\n\n5. A Bowl Full Of Floating Flowers:\n\nIf you love indulging in the art of hosting every now and then, you are sure to have a few extra glass bowls tucked away in your cabinet. This is where you can put them to good use. Fill them halfway with water. Trim the stems of the flowers until they are only about one inch long. Cut a circle of bubble wrap slightly smaller than the head of the flower, so that it is not too visible. Make a hole in the centre of the bubble wrap, large enough to hold the stem. Insert the stem in it, and let the flowers float free. If you plan to host at dusk, add some floating candles to the bowl.\n\n6. Flowers, In Contrast:\n\nIf you want your table painted with a pop of colors, take the contrast route. Given that flowers come in shades we do not even know of, there is a lot you can experiment with here. You can go wild and make extreme combinations like white with red, lavender with light pink, yellow with green. More often than not, white flowers paired with any color makes for a soothing sight. Here is where you can opt for large-sized flowers for the colors to speak louder.\n\n7. Hanging Flower Balls:\n\nDisco balls have been the life of the party ever since their arrival. Much like them, hanging flower balls also work wonders when adding a little fun to the celebration. Flowers arranged as a sphere are eye-catching. Create floral balls out of foam blocks, sturdy wire, silky ribbons and flowers of your choice. You can adorn the ceiling area right above your table with flowers balls, all in different shapes and colors to make things more dramatic.\n\nOrder Handcrafted Vases Online From Ikai Asai\n\nNow that the list of flower arrangement ideas for home is ready for your rescue, all you need is the perfect vessel to assemble it all. Ikai Asai is home to vases that are born out of different types of crafts - Longpi , Terracotta , Kansa Kaam , Glasswork , and Ceramics (Kutch Clay) . Each piece is a product of fine craftsmanship; a legacy created by talented artisans from many corners across the country. Our collections also feature thoughtfully crafted dinnerware , serveware and table linen . Browse through our collections, place your order online, and curate one-of-a-kind table settings."
  },
  {
    "title": "The Art Of Papier Mache: Origin, Products & Care",
    "date": "September 06, 2021",
    "author": "By Ikai Asai",
    "excerpt": "Apart from its obvious purpose, paper has also served art for decades. Previously, it was essentially and commonly used as a white background in matters of art; an empty canvas...",
    "url": "https://ikaiasai.com/blogs/blogs/papier-mache-art-and-craft",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Papier_Mache_1080x.png",
    "content": "Apart from its obvious p urpose, paper has also s erved art for decades. Previously, it was essentially and commonly used as a white background in matters of art; an empty canvas waiting for vivid colors to breathe life into it. And then, of course, there was our favourite childhood pastime - crafting boats out of perfectly cut paper squares each time the rains came pouring down. Over time paper crafts have evolved, and beautifully so. To name a few - the art of origami, quilling, scrapbooking, decoupage and papier mache. Of all these, papier mache craft creates pieces that are not just visually appealing, but equally functional as well. So, what is papier mache , where was the craft born, and how does it serve us? Papier Mache originated in China, eventually spreading to Japan and Persia. In the 15th century, Persian scholar Shah-e-Hamadan brought 700 artisans from Persia to Kashmir. Today, it is majorly practiced by the Shia community; made in homes, and workshops, in Srinagar, and other parts of the Kashmir Valley. It primarily consists of paper pulp, and is a richly decorated, colourful artifact, made generally in the form of decorative objects. There’s no better way than papier mache to adorn your home with art, while also contributing to preserving the environment. It is an excellent way to reduce, reuse and recycle. The products are light-weight and non-toxic, and hence safe to be used by children. The process of creating pieces out of this craft in itself is a delight; here’s what goes into the making of our vessels-\n\nHow To Make Papier Mache : Our Process-\n\nPaper pulp is created through soaking or boiling the paper 2. To this, the adhesive is added\n\nThen, paper strips are glued together with an adhesive on a form for which support is needed 4. To shape these paper strips precisely; reinforcements are done with wires, lightweight shapes, balloons, or textiles\n\nTraditional adhesive use a mixture of water and flour or other starch, mixed to the consistency of heavy cream\n\nOur Papier Mache Products\n\nOur papier mache vessels are crafted in Kashmir, and carefully contrasted in bold hues of red & white. A refined result of a thorough process, each product is sure to impress. Here’s a glimpse into our collection-\n\n1. FETE - Set Of 3 Bowls Dimensions (cm): (Large) Height: 4.8 | Diameter: 27 2. REID - Set Of 2 Round Trays Dimensions (cm): Height: 1.5 | Diameter: 20 3. JEST - Single Bowl Dimensions (cm): Height: 9 | Diameter: 23.5 4. JESTA - Single Round Tray Dimensions (cm): Height: 3.9 | Diameter: 12.2 5. JULO - Single Rectangular Tray Dimensions (cm): Length: 24.5 | Breadth: 14 | Height: 2.5 6. JULA - Set Of 2 Rectangular Trays Dimensions (cm): Length: 18.8 | Breadth: 8.5 | Height: 3.6 7. LAALTA - Single Planter (painted in two colors) Dimensions (cm): Length: 21 | Breadth: 17.3 | Height: 21 8. LAALTO - Single Planter (white on the outside; red on the inside) Dimensions (cm):  Length: 17.8 | Height: 15 | Breadth: 17.8 9. STRETI - Single Square Box with Lid Dimensions (cm): Length: 22.5 | Breadth: 22.5 | Height: 8.7 10. STRETO - Single Round Box with Lid Dimensions (cm): Height: 5.8 | Diameter: 17.3 11. STRETA - Single Round Box with Lid Dimensions (cm): Height | 10.5, Diameter: 14\n\nHow To Care For Your Papier Mache Pieces?\n\nOur papier mache pieces are intricately handcrafted by the artisan, making them unique. To make the most of them and have them at your service for long, you have to treat them with care. The most important thing is to keep them away from all liquids as they are made from paper. Here are some of the other points to be remembered-\n\nDO’s:\n\n- Use only dry cloth to remove dust\n\n- Use to store lightweight and dry items\n\n- Store in a cool and dry place\n\nDON’Ts:\n\n- Use wet cloth or chemicals to remove dust\n\n- Use it in microwave\n\nBring Home The Papier Mache Art With Ikai Asai"
  },
  {
    "title": "Good Food, Served Well: Types Of Plates",
    "date": "August 17, 2021",
    "author": "By Ikai Asai",
    "excerpt": "When it comes to food experiences, presentation matters. Everything on your plate has to be a representation of how different ingredients have come together to bring you a little taste...",
    "url": "https://ikaiasai.com/blogs/blogs/types-of-plates",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/DSC2200_1_1080x.jpg",
    "content": "When it comes to food experiences, presentation matters. Everything on your plate has to be a representation of how different ingredients have come together to bring you a little taste of heaven. After all, if we like what we see , we tend to naturally develop a liking for it. And, a perfectly carved platter lies at the foundation of it all. A plate may seem like a less significant detail but it brings a unique charm to the table, and is an important part of the bigger picture. The dilemma of choosing from different types of plates for serving food is quite real given that there is plenty to choose from - a treasure trove of shapes, sizes, forms, colors, patterns, textures - and the list goes on. Plates are not just celebrated for their aesthetic appeal; each one serves its very own purpose. It is important to pick the ones that perfectly fit into the theme you have chosen for your occasion, and the menu for the evening. So, what are the different types of dinner plates when it comes to craft types? Let’s take a look at the types of dinner plates brought to you with love from Ikai Asai, along with the thoughtful process that goes into it.\n\n3 Types of Plates Material-wise 1. Terracotta Plates\n\nFrom drinkware, cookware to serveware, terracotta products are claiming their rightful place on many shelves. Terracotta clay products come in extensive selections of designs, sizes, and shapes. Few of the modern-day terracotta plates are also known to be microwave-safe. They also bring you benefits in terms of wellness as they help neutralize the food’s acid content. The earthiness of terracotta plates help you serve tastier food. Using ancestral knowledge, our craftsmen take from the finest of nature to create exquisite plates.\n\n-Then it's mounted at the centre of the potter's wheel for our craftsman to shape it.\n\n-Once the shape is ready, it is dried under the sun for 2-3 days.\n\n-It is then fired in a traditional bhatti, an open furnace, powered by local fuel such as dry coconut leaves or small wooden pieces.\n\n-Once ready, this extensively treated piece is given a beautiful transparent glaze to give it a refined finish.\n\n2. Kansa Plates\n\nKansa is the traditional (Indian) name for Bell metal. This metalware is made using a 4:1 proportion of copper to tin. Different regions have their own names for it. In Assam, it is called Kanh; while in West Bengal and Odisha, Kansa. It is widely used for cooking and eating utensils. One of the reasons for its popularity is that eating food served in Kansa plates regularly can boost our immunity system. It also does a brilliant job of retaining heat, keeping the food warmer for a longer duration. Our gifted Kansari Karigars use only handmade tools to create plates that serve you well.\n\n-This ball of metal is then melted and set into a small thick coin.\n\n-Then using a Hatudi, the coin is hammered and beaten into the desired shape. After that the shape is cast and turned into a Koi (crucible). This entire process is called heat and beat. It is a collaborative activity needing the perfect coordination of at least four Kansari Karigars.\n\n-The entire process from melting Pital to the final embossing is done under one roof, where each member of the tribe specialises in and performs a singular part of the process.\n\n3. Studio Pottery Plates:\n\n-Kneaded to perfection, the prepared clay is then mounted on the potter's wheel.\n\n-Our craftsmen then give it a shape using traditional hand-building techniques.\n\n-Once the shape is ready, it's fired in a bisque powered by local fuel.\n\n-After the shape solidifies, it's glazed to give it a natural sheen.\n\n-Once ready, the piece is left to dry under the sun for 2-3 days.\n\n-On drying, this piece is glazed by dipping, trailing or brushing on a thin slurry composition of the glaze and water and then it's fired in a bisque.\n\n-The colour of the glaze changes significantly before and after firing.\n\n-The glazing process renders porous pottery vessels impermeable to water and other liquids, increasing their shelf life.\n\nExplore Different Types of Plates for Food with Ikai Asai\n\nThe next time you are hosting an event, turn to Ikai Asai. We are home to plates born out of terracotta, ceramic, kansa, studio pottery, black clay pottery and more. Browse through our collections of handcrafted serveware and dinnerware to best serve and host your guests!"
  },
  {
    "title": "For The Love Of Wine: Types Of Glasses",
    "date": "August 17, 2021",
    "author": "By Ikai Asai",
    "excerpt": "Life as we know it is full of facts and fables. One of the most agreed upon facts is that a glass of wine makes for better dining experiences. Wine...",
    "url": "https://ikaiasai.com/blogs/blogs/types-of-wine-glasses",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/VCaGtwNg_1_1080x.jpg",
    "content": "Life as we know it is full of facts and fables. One of the most agreed upon facts is that a glass of wine makes for better dining experiences. Wine is one of the few things that not only stands the test of time, but ages rather well with it. From the very moment you uncork the bottle to that gentle swirling of the glass to those little sips that soothe your senses - the entire process is a rare indulgence, one that lingers long after the moment has passed, leaving us in a daze of sheer delight. When we talk of barware, different kinds of wine glasses come to mind. The shape and size of a wine glass can make a significant difference when it comes to flavors and aromas. The best part about wine indulgences is that we don’t necessarily have to be a sommelier to revel in its bittersweet characteristics; one just has to have an acquired taste for it. But, if you want to dive a little deeper into the many wonders of wine, there’s a lot to be discovered. You can start with familiarizing yourself with different types of wine glasses. Let’s begin with the difference between red wine and white wine glass . White wine glasses have smaller bowls, and their walls are less curved as well. They have much narrower openings as compared to red wine glasses. Here are some other popular wine glass types and uses -\n\n10 Types Of Wine Glasses\n\n1. Bordeaux Wine Glass:\n\nThis one stands tall, and is a perfect fit for full-bodied red wines like a Cabernet. The shape of the glass allows younger wines to breathe free. But, the true beauty of this glass lies in the way its large bowl directs the wine to the back of your mouth.\n\n2. Burgundy Wine Glass:\n\nDelicate wines demand and deserve more room - Pinot Noir, Italian Barolo, and Barbaresco - to name a few. You can relish their flavors in these bigger bowled glasses. They enhance the acidity and intensity of medium to full-bodied wines.\n\n3. Chardonnay Wine Glass:\n\nThis one is designed to please the chardonnay lovers above all. It is a u-shaped bowl, and is slightly upright. It has a larger opening that lets the wine flow to the sides and tip of your tongue, allowing you to truly cherish your chilled wine.\n\n4. Cabernet Wine Glass:\n\nIf you are an ardent appreciator of aromas, this glass is made for you. When it comes to this wine glass, the less you pour, the more fragrant the wine is - all thanks to its wide bowl and a narrow mouth. It allows the wine to breathe properly, and brilliantly captures the aroma.\n\n5. Rosé Wine Glass:\n\nRosé never fails to bring exquisite indulgences, and therefore deserves to be treated right. These long-stemmed glasses provide just the right consistency in temperature. If you plan to sip on a mature wine, a short-tapered Rosé glass is your best bet.\n\n6. Pinot Noir Wine Glass:\n\nThis one's for sweet tooths. The turned-out flared lip of the glass directs fruity, and crisp wines to the front of the palate. Since the glass is large-bowled, it makes the art of swirling all the more fun.\n\n7. Sparkling Wine Glass:\n\nWhen it comes to sparkling wine or Champagne, the right glass can make all the difference. The chances of it falling flat are higher if you choose the wrong-shaped glass. This glass is designed to save you from just that. It has an upright shape to help maintain carbonation.\n\n8. Zinfandel Wine Glass:\n\nThe shape of this wine glass brings out the wine's rich, fruity notes. It features a smaller bowl compared to the Bordeaux glass. Its thin rim directs the flow of the wine to the center of the tongue, allowing you to experience each shade of flavor.\n\n9. Port Wine Glass:\n\nThis regal glass is made to celebrate the aroma of a sweet dessert or port wine. It's a much shorter version of a Bordeaux wine glass, but brings you delight in abundance.\n\n10. Viognier Wine Glass:\n\nWhite wine enthusiasts, this one's for you. Although it serves to be a good match for all kinds of wines, it's best paired with aromatic, slightly tangy, crisp white wines. An elegant glass for many indelible wine experiences.\n\nBuild Your Barware with Ikai Asai\n\nNow that you know of the different styles of wine glasses , it’s time to make them a part of your barware with Ikai Asai. Our barware collection comprises handcrafted wine glasses, decanters, coasters, corkscrews, shakers, shot glasses, peg measure, and bottle stoppers. When it comes to wine glasses , each piece of ours celebrates a legacy. Presently, in the bustling town of Firozabad in India, our craftsmen follow centuries-old glass blowing traditions to create this glassware. Each piece is inflated with a blowpipe to form a glass bubble and then carefully moulded into contemporary glassware; the perfect amalgam of heritage and modern art.\n\nOur Process:\n\n-First, molten glass is inflated with a blowpipe to form a glass bubble, which gives it a bulbous shape. Each piece is mouth-blown individually by our craftsmen.\n\n-Then each piece of inflated glass is moulded into a shape according to its utility.\n\n-All our shapes are largely inspired by traditional Indian utensils. Which is why this glassware is also well-known as Indian Hand-blown Glass.\n\n-Also, it's interesting to know that, in keeping with the other forms of the Deva collection, our shapes have been kept very simple so they can complement other materials as well."
  },
  {
    "title": "The Art Of Longpi Pottery: Origin, Process, & Benefits",
    "date": "July 31, 2021",
    "author": "By Ikai Asai",
    "excerpt": "There are very few things in life that have the ability to evoke emotions, each time we witness them. One of those things is the elegant art of Longpi pottery...",
    "url": "https://ikaiasai.com/blogs/blogs/discover-the-art-of-longpi-pottery",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Screenshot_2021-07-31_210951_1_1080x.png",
    "content": "There are very few things in life that have the ability to evoke emotions, each time we witness them. One of those things is the elegant art of Longpi pottery - an art form born in the small village of Longpi in Manipur that has now traveled far and wide, claiming its rightful place in the hearts of art connoisseurs across the world. If you know of the craft, you are familiar with the way it embodies perfection. If you are new to this world of black stone pottery, let’s discover the origin, the process, and the many benefits of this Manipur pottery.\n\nThe Tale: Black Pottery In Manipur\n\nLongpi village is the birthplace of black stone pottery in Manipur; the art is called Longpi Ham locally. This is a rare form of pottery where the craftsmen do not use the pottery wheel.\n\nThe pieces (pots, pans, vases & more) are made from a mixed paste of ground black serpentinite stone and special brown clay. The clay is native to only Longpi village. Back in the day, these pots were primarily used as a cooking utensil among the Tangkhuls before aluminium pots entered the picture. Longpi Pottery is now used both for cooking, and for storing food and beverages. But, where did it all truly begin? It is believed that Longpi Pottery took shape and form by the grace of Goddess Panthoibi. The craftsmen regard the Goddess as the mother of artefact-making. Distinguished by its surreal black glow and rustic matte finish, this Manipuri pottery carries great historical significance. Longpi vessels were exclusively used in royal rituals, religious ceremonies and meaningful gatherings. In mythology, the earthen pot is said to resemble a womb, carrying healing medicinal properties. In the past the privilege of owning black pottery pieces was restricted to the wealthier class of the society. Today, it adorns many homes that have plenty of room for art that is both exceptional and functional.\n\nBlack Stone Pottery: Process\n\nGreat works of art demand patience and perseverance, only then can they stand a chance to be eternal. At Ikai Asai, each piece is handcrafted by artisans who live to serve a legacy. Here is the process adopted by them: -Our craftsmen decide a clay ratio as per the size of the piece and knead clay dough.\n\n- This clay dough is then left to age for a few days. -After that, the dough is shaped by hand or in a mould and left to dry under the shade, until it takes on a greenish hue.\n\n- On drying, the shape is burnished to get the perfect finish.\n\n- At this stage, some designs require our craftsmen to make holes for cane accents.\n\n- Now each piece is dried under a shade and sun-dried further to properly dehydrate the clay.\n\n- Post that, the pieces are bisque fired at a temperature of 700 to 900 degree Celsius.\n\n- Finally, some leaves are rubbed onto our scalding artefacts to cool them until ready.\n\nLongpi Pottery Benefits & Facts\n\n-The colour (black) is naturally obtained. No chemicals or paints play a part in it. -No chemicals, machines or wheels are used in the making of the pottery pieces. -The pottery form is responsible for creating employment opportunities in rural areas as the entire process is handcrafted. -Longpi pots and pans are incredibly flexible in the sense that they can be used on gas stoves, open fire, and can be tossed in the oven as well.\n\n-The pots are great for simmering and slow cooking over a low flame for a longer period of time to bring out all the delicious flavours from the ingredients.\n\n-The cups and mugs are ideal for coffee, tea, juices or even chilled beer.\n\n-Longpi products do not harm the environment in any way. The raw materials used in the pottery are completely natural. The products are easily biodegradable.\n\nExperience The Best Of Black Clay Pottery In India\n\nCrafted by hand-patting clay, our unglazed pieces acquire their natural sheen from an age-old low-firing process. Moreover, Longpi chips on ageing, creating unique patterns on each artefact; the perfect homage to the beautiful imperfections of the handmade. Here are few of our pieces, crafted with care- 1. DALIA - Longpi Fruit Bowl : Good health and great flavors brought together in an earthy bowl.\n\n2. AMARAN PETITE - Longpi Salad Plate : Indulge in a platter brimming with wellness.\n\n3. INURE MAGNA - Longpi Dry Snack Bowl (L) : Pick little-big delight s from this offspring of clay. 4. MVURA - Longpi Cylindrical Tumblers : Quench your thirst for home and hearth.\n\n5. BAHASA - Longpi Water Jar : Pour your fill from a jar delicately moulded in mud. 6. VIVANTE (R) - Longpi Succulent Plant Holder (R) : Here’s an earthy home for the gorgeous greens.\n\n7. SAATVIKA - Longpi Raised Platter : Let each meal be a celebration; an invitation to good times. 8. AESTHETE - Longpi Globular Vase : With this piece, nature finds its way back home."
  },
  {
    "title": "Shades of Red & Blue in Indapur",
    "date": "July 31, 2021",
    "author": "By Ikai Asai",
    "excerpt": "Indapur’s soil, red with the passion of its ancestors, blesses the artisans’ wheels. Lines of brick walls appear as we set walking in Indapur in Maharastra, stopping to glance at the unplanned...",
    "url": "https://ikaiasai.com/blogs/blogs/shades-of-red-blue-in-indapur",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Indapur_1080x1080-1_1080x.jpg",
    "content": "Indapur’s soil, red with the passion of its ancestors, blesses the artisans’ wheels. Lines of brick walls appear as we set walking in Indapur in Maharastra , stopping to glance at the unplanned symmetry of the oft broken structures that once set out to be someone’s home. Someone’s hearth, raging with fire. Brick walls are made and unmade with fire - one cannot set to stone what hasn’t been baked in its uncompromising flames. Mudwalls of a colour that is at once terracotta and turmeric. A visual delight lapped with folk wisdom and inherited mix of beauty and skill, born out of one’s interaction with their environment. Can colours trigger a particular sort of smell only through pure sight?\n\nBooks on ancient trade were filled with tales of spices - the spice route, the root of colonisation of the oriental world. Sometimes imperialism begins to evoke the scent of spices. But let’s talk of imperial blue instead. And indigo. Born of the indigo plant, born of the precious lapis lazuli. Pigments are born of all things born of the earth. They leave behind an aftertaste that may blend with the spices in your food and carry you back to lost time and spaces."
  },
  {
    "title": "Celebrating Holi with Eeshaan Kashyap",
    "date": "July 31, 2021",
    "author": "By Ikai Asai",
    "excerpt": "\"I prefer living in Colour. Happy Holi!\" – Curator of Food & Beverage, Eeshaan Kashyap. Celebrating life surrounded by colours, flavours, friendship and cocktails - the afternoon was soaked in laughter and colour, it beguiled...",
    "url": "https://ikaiasai.com/blogs/blogs/celebrating-holi-with-eeshaan-kashyap",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Experiences_1080x1080-3_1080x.jpg",
    "content": "\"I prefer living in Colour . Happy Holi!\" – Curator of Food & Beverage, Eeshaan Kashyap. Celebrating life surrounded by colours , flavours , friendship and cocktails - the afternoon was soaked in laughter and colour , it beguiled sensorial indulgence. Our contemporary barware from KAMA, was used to curate the experience.\n\nRECIPE Eeshaan Kashyap’s Paan & Khus Vodka recipe is a favorite, see below to see how he created it. Method: Add the gently torn khus and paan leaves to boiling water. Simmer for a few minutes. Pass the infusion through a sieve and collect 20 ml of it in a shaker. Add the remaining ingredients and shake with crushed ice and vodka. Pour the concoction into a glass and rim the edges with black salt. Add a wedge of lime to finish."
  },
  {
    "title": "An Ode to Preserving Summer",
    "date": "July 29, 2021",
    "author": "By Ikai Asai",
    "excerpt": "A bazaar painted by myriad shades of yellow. A crate of fresh mangoes sent over by the neighbour. An ordinary daal transformed by slices of tart fruit. Sticky corners of a mouth. Long...",
    "url": "https://ikaiasai.com/blogs/blogs/an-ode-to-preserving-summer",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/1080x1080-5_1080x.jpg",
    "content": "A bazaar painted by myriad shades of yellow. A crate of fresh mangoes sent over by the neighbour . An ordinary daal transformed by slices of tart fruit. Sticky corners of a mouth. Long evenings on the verandah with loved ones. For centuries, pickling has allowed us to bottle memories in oil and spice, keeping them aside for a later day. While this tradition may be losing popularity, Ikai Asai has collaborated with local artisans to craft paraphernalia that will nudge us to come together and pickle once again. Through this activity, we hope you will be able to reminisce easier times, and long for new summers. Share your pickling experiences with #PreservingSummer"
  },
  {
    "title": "Afternoon Coffee in Channapatna",
    "date": "July 29, 2021",
    "author": "By Ikai Asai",
    "excerpt": "In the small segment of Channapatna we visited, the houses were abuzz with activities yet in a curiously quiet way. Filling them with sights and sounds and smells that may not escape...",
    "url": "https://ikaiasai.com/blogs/blogs/afternoon-coffee-in-channapatna",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Channapatna_1080x1080-1_1080x.jpg",
    "content": "In the small segment of Channapatna we visited, the houses were abuzz with activities yet in a curiously quiet way. Filling them with sights and sounds and smells that may not escape the houses too often. Just like the scent and warmth of filter coffee, trapped in the earthen pots that sit quietly on the floor.The whirl of machines and watching an artisan give shape to a toy can be hypnotising . Between their nimble fingerwork and tireless work, they sip tumblers of filter coffee to keep their bodies and minds running. And that, honestly, seems enough.\n\nEvery place has a taste. You remember spots with colours , or long for a corner of the world for the special scents and tastes they carry. The sweetness of coffee blends and loses boundaries with the intense smell of lacquer. Coffee smells like old friendships and cosy hugs. But here, in this craft town, coffee also smells like hard work and relentless dedication to work from morning till evening. Tumblers of filter kaapi keep the fuel for deadlines running and the bond between the artisans intact. They smell of hope, for the continuity of a craft form that puts Karnataka on the world map."
  },
  {
    "title": "The Art of Weaving in Kutch",
    "date": "July 29, 2021",
    "author": "By Ikai Asai",
    "excerpt": "The artisan woke up at dawn to bring the yarn skeins out before the sun is out too vividly, and washed them before they are laid out to warp. He...",
    "url": "https://ikaiasai.com/blogs/blogs/the-art-of-weaving-in-kutch",
    "image_url": "https://ikaiasai.com/cdn/shop/articles/Kutch_1080x1080-1_1080x.jpg",
    "content": "The artisan woke up at dawn to bring the yarn skeins out before the sun is out too vividly, and washed them before they are laid out to warp. He cradled unassumingly in his hands with love and labour , in response to the sun and the ether for that right balance of the elements. And just like that, I realised the meaning of mindfulness. This everyday quality of traditional craft is most magical. It is what upholds passion and creativity, achieved by people performing tasks in unity, not set far from society and common people in isolation but born right in the midst of it. Set to rhythm by an adherence to time, weather, and seasonal changes, signifying man’s interactions with the world around them and swiftly portraying it in the closest possible materials available to them.\n\nWhat if we pause and wonder what the first loom on earth would have looked like? How did our ancestors arrive at this exquisite piece of engineering that requires a structure meant to fasten yarn together in order to weave them into textiles? It is a reckoning of history, of thousands of years of evolving human hand and aesthetic put to practice on a humble device that click-clocks rhythmically in a shed. Far from the machine made perfections of a powerloom , it exudes with beauty and the story of strife and survival."
  }
]